In [2]:
%matplotlib inline
import pandas as pd

In [3]:
titles = pd.read_csv('../dataset/titles.csv')

# faster to calculates such 30s or 50s .)

titles['decades'] = titles['year'] // 10 * 10


titles.head()

                          title  year  decades
0         Chatur Singh Two Star  2011     2010
1     Night Train for Inverness  1960     1960
2                Njiur melambai  1951     1950
3  Roya-ye nime-shab-e tabestan  1994     1990
4       Undskyld jeg forstyrrer  2012     2010

In [4]:
cast = pd.read_csv('../dataset/cast.csv')

cast['decades'] = cast['year'] // 10 * 10

cast.head()

,title,year,name,type,character,n,decades
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0,2010
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0,1980
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0,2010
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN,2010
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN,2010

In [12]:
k = cast

g = k.groupby(['decades', 'type']).size()

g
# how can we compare them

decades  type
1890     actor           2
         actress         1
1900     actor          54
         actress        16
1910     actor       27605
         actress     15830
1920     actor       48726
         actress     24075
1930     actor      151290
         actress     49972
1940     actor      162364
         actress     51795
1950     actor      157738
         actress     57733
1960     actor      134605
         actress     57744
1970     actor      152811
         actress     66974
1980     actor      197530
         actress     91509
1990     actor      263000
         actress    125040
2000     actor      489468
         actress    263941
2010     actor      747346
         actress    448737
2020     actor         140
         actress       127
2110     actor           2
         actress         1
dtype: int64

In [10]:
g.unstack()

# more interesting way :)

type      actor  actress
decades
1890          2        1
1900         54       16
1910      27605    15830
1920      48726    24075
1930     151290    49972
1940     162364    51795
1950     157738    57733
1960     134605    57744
1970     152811    66974
1980     197530    91509
1990     263000   125040
2000     489468   263941
2010     747346   448737
2020        140      127
2110          2        1

### Define a year as a "Superman year" whose films feature more Superman characters than Batman. How many years in film history have been Superman years?

In [21]:
m = k[(k.character == 'Superman') | (k.character == 'Batman')]

g = m.groupby(['year', 'character']).size()

g.unstack().fillna(0)

character  Batman  Superman
year
1938          1.0       0.0
1940          1.0       0.0
1943          1.0       0.0
1948          0.0       1.0
1949          2.0       0.0
1950          0.0       1.0
1951          0.0       2.0
1953          2.0       0.0
1954          0.0       5.0
1955          0.0       1.0
1957          2.0       0.0
1965          1.0       0.0
1966          1.0       0.0
1967          1.0       0.0
1973          1.0       2.0
1978          0.0       2.0
1980          0.0       2.0
1981          1.0       1.0
1983          0.0       2.0
1985          2.0       2.0
1987          0.0       1.0
1988          1.0       0.0
1989          1.0       0.0
1991          1.0       1.0
1992          1.0       1.0
1993          2.0       0.0
1994          1.0       1.0
1995          1.0       1.0
1997          1.0       1.0
1998          1.0       0.0
1999          1.0       0.0
2002          1.0       1.0
2003          1.0       1.0
2004          1.0       0.0
2005          1.0       0.0
2006          0.0       1.0
2008          3.0       2.0
2009          3.0       1.0
2010          3.0       1.0
2011          4.0       2.0
2012          2.0       1.0
2013          5.0       1.0
2014          5.0       1.0
2015          4.0       1.0
2016         12.0       4.0
2017          9.0       5.0
2018          4.0       2.0

### How many years have been "Batman years", with more Batman characters than Superman characters?

### Plot the number of actor roles each year and the number of actress roles each year over the history of film.

### Plot the number of actor roles each year and the number of actress roles each year, but this time as a kind='area' plot.

### Plot the difference between the number of actor roles each year and the number of actress roles each year over the history of film.

### Plot the fraction of roles that have been 'actor' roles each year in the history of film.

### Plot the fraction of supporting (n=2) roles that have been 'actor' roles each year in the history of film.

### Build a plot with a line for each rank n=1 through n=3, where the line shows what fraction of that rank's roles were 'actor' roles for each year in the history of film.